server/templates/v_10/suministroBienesInversion/suministroLRBienesInversion.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
 xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<sum:SuministroLRBienesInversion>
			<sum1:Cabecera>
				<sum1:IDVersionSii>{{ cabecera.idVersion }}</sum1:IDVersionSii>
				<sum1:Titular>
					<sum1:NombreRazon>{{ cabecera.titular.nombreRazon }}</sum1:NombreRazon>
					{{#if cabecera.titular.nifRepresentante}}
					<!--Optional:-->
					<sum1:NIFRepresentante>{{ cabecera.titular.nifRepresentante }}</sum1:NIFRepresentante>
					{{/if}}
					<sum1:NIF>{{ cabecera.titular.nif }}</sum1:NIF>
				</sum1:Titular>
				<sum1:TipoComunicacion>{{ cabecera.tipoCom }}</sum1:TipoComunicacion>
			</sum1:Cabecera>
			<!--1 to 10000 repetitions:-->
			{{#each registroLRBienesInversion}}
			<sum:RegistroLRBienesInversion>
				<sum1:PeriodoImpositivo>
					<sum1:Ejercicio>{{ this.periodoImpositivo.ejercicio }}</sum1:Ejercicio>
					<sum1:Periodo>{{ this.periodoImpositivo.periodo }}</sum1:Periodo>
				</sum1:PeriodoImpositivo>
				<sum:IDFactura>
					<sum1:IDEmisorFactura>
						<sum1:NombreRazon>{{ this.idFactura.idEmisorFactura.nombreRazon }}</sum1:NombreRazon>
						<!--You have a CHOICE of the next 2 items at this level-->
						{{#if this.idFactura.idEmisorFactura.nif}}
						<sum1:NIF>{{ this.idFactura.idEmisorFactura.nif }}</sum1:NIF>
						{{/if}}{{#ifNot this.idFactura.idEmisorFactura.nif}}
						<sum1:IDOtro>
							{{#if this.idFactura.idEmisorFactura.idOtro.codigoPais}}
							<!--Optional:-->
							<sum1:CodigoPais>{{ this.idFactura.idEmisorFactura.idOtro.codigoPais }}</sum1:CodigoPais>
							{{/if}}
							<sum1:IDType>{{ this.idFactura.idEmisorFactura.idOtro.idType }}</sum1:IDType>
							<sum1:ID>{{ this.idFactura.idEmisorFactura.idOtro.id }}</sum1:ID>
						</sum1:IDOtro>
						{{/ifNot}}
					</sum1:IDEmisorFactura>
					<sum1:NumSerieFacturaEmisor>{{ this.idFactura.numSerieFacturaEmisor }}</sum1:NumSerieFacturaEmisor>
					<sum1:FechaExpedicionFacturaEmisor>{{ this.idFactura.fechaExpedicionFacturaEmisor }}</sum1:FechaExpedicionFacturaEmisor>
				</sum:IDFactura>
				<sum:BienesInversion>
					<sum1:IdentificacionBien>{{ this.bienesInversion.identificacionBien }}</sum1:IdentificacionBien>
					<sum1:FechaInicioUtilizacion>{{ this.bienesInversion.fechaInicioUtilizacion }}</sum1:FechaInicioUtilizacion>
					<sum1:ProrrataAnualDefinitiva>{{ this.bienesInversion.prorrataAnualDefinitiva }}</sum1:ProrrataAnualDefinitiva>
					{{#if this.bienesInversion.regularizacionAnualDeduccion}}
					<!--Optional:-->
					<sum1:RegularizacionAnualDeduccion>{{ this.bienesInversion.regularizacionAnualDeduccion }}</sum1:RegularizacionAnualDeduccion>
					{{/if}}{{#if this.bienesInversion.identificacionEntrega}}
					<!--Optional:-->
					<sum1:IdentificacionEntrega>{{ this.bienesInversion.identificacionEntrega }}</sum1:IdentificacionEntrega>
					{{/if}}{{#if this.bienesInversion.regularizacionDeduccionEfectuada}}
					<!--Optional:-->
					<sum1:RegularizacionDeduccionEfectuada>{{ this.bienesInversion.regularizacionDeduccionEfectuada }}</sum1:RegularizacionDeduccionEfectuada>
					{{/if}}
				</sum:BienesInversion>
			</sum:RegistroLRBienesInversion>
			{{/each}}
		</sum:SuministroLRBienesInversion>
	</soapenv:Body>
</soapenv:Envelope>